In [3]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('House_Data.csv.xls')

In [5]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [6]:
df2=df.drop(['area_type','society','bath','availability'],axis=1)

In [7]:
df2.describe()

            balcony         price
count  12711.000000  13320.000000
mean       1.584376    112.565627
std        0.817263    148.971674
min        0.000000      8.000000
25%        1.000000     50.000000
50%        2.000000     72.000000
75%        2.000000    120.000000
max        3.000000   3600.000000

In [8]:
df.groupby('area_type').agg('count')

,availability,location,size,society,total_sqft,bath,balcony,price
area_type,,,,,,,,
Built-up Area,2418,2418,2418,1215,2418,2410,2310,2418
Carpet Area,87,87,87,54,87,87,82,87
Plot Area,2025,2025,2009,311,2025,2009,1837,2025
Super built-up Area,8790,8789,8790,6238,8790,8741,8482,8790

In [9]:
df2.head()

                   location       size total_sqft  balcony   price
0  Electronic City Phase II      2 BHK       1056      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600      3.0  120.00
2               Uttarahalli      3 BHK       1440      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521      1.0   95.00
4                  Kothanur      2 BHK       1200      1.0   51.00

In [10]:
df2.isna().sum()

location        1
size           16
total_sqft      0
balcony       609
price           0
dtype: int64

In [11]:
df3=df2.dropna()

In [16]:
df3['bhk']=df3['size'].apply(lambda x:int(x.split(' ')[0]))

/var/folders/lb/j81n4r5516l0zy01s9b7gllh0000gn/T/ipykernel_6625/2780422925.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk']=df3['size'].apply(lambda x:int(x.split(' ')[0]))

In [23]:
df3.groupby('location')['location'].agg('count').sort_values(ascending=False)

location
Whitefield              514
Sarjapur  Road          372
Electronic City         300
Kanakpura Road          261
Thanisandra             231
                       ...
Kalhalli                  1
Kalkere Channasandra      1
 Banaswadi                1
Kamdhenu Nagar            1
whitefiled                1
Name: location, Length: 1265, dtype: int64